In [13]:
import sqlite3

In [14]:
import numpy as np

In [15]:
import pandas as pd

In [16]:
db = sqlite3.connect('db.sqlite3')
cursor = db.cursor()

In [17]:
df = pd.read_sql("SELECT * FROM cafe_record", db, index_col='id')

In [20]:
df.head(4)

                     date_time  allocated deleted_table  table_id
id
1   2022-05-22 11:16:52.451486          1          None         2
2   2022-05-22 11:16:55.947800          1          None         8
3   2022-05-22 11:16:58.873779          1          None         1
4   2022-05-22 11:17:04.911265          1          None         3

In [23]:
df.iloc[0,2] = 4
df.iloc[0, 3] = None

In [24]:
df['table'] = df[['table_id', 'deleted_table']].apply(lambda x: x['table_id'] if x['table_id'] else x['deleted_table'], axis=1)

In [25]:
df.head(4)

                     date_time  allocated deleted_table  table_id  table
id
1   2022-05-22 11:16:52.451486          1             4       NaN    NaN
2   2022-05-22 11:16:55.947800          1          None       8.0    8.0
3   2022-05-22 11:16:58.873779          1          None       1.0    1.0
4   2022-05-22 11:17:04.911265          1          None       3.0    3.0

In [10]:
df2 = df[['table_id', 'deleted_table']].apply(lambda x: x['table_id'] if x['table_id'] else x['deleted_table'], axis=1)
# (lambda x: x['table_id'] if x['table_id'] else x['deleted_table'] )
df2

id
1     2
2     8
3     1
4     3
5     9
6     3
7     1
8     2
9     8
10    9
11    1
12    3
13    2
14    8
15    2
16    1
17    1
dtype: int64

In [11]:
df

                     date_time  allocated deleted_table  table_id table
id
1   2022-05-22 11:16:52.451486          1          None         2   NaN
2   2022-05-22 11:16:55.947800          1          None         8   NaN
3   2022-05-22 11:16:58.873779          1          None         1   NaN
4   2022-05-22 11:17:04.911265          1          None         3   NaN
5   2022-05-22 11:19:01.380699          1          None         9   NaN
6   2022-05-22 11:19:06.313556          0          None         3   NaN
7   2022-05-22 11:19:10.190905          0          None         1   NaN
8   2022-05-22 11:19:17.991973          0          None         2   NaN
9   2022-05-22 11:19:18.207662          0          None         8   NaN
10  2022-05-22 11:19:18.328663          0          None         9   NaN
11  2022-05-22 11:19:21.601864          1          None         1   NaN
12  2022-05-22 11:19:26.492553          1          None         3   NaN
13  2022-05-22 11:19:34.447391          1          None         2   NaN
14  2022-05-22 11:19:34.643372          1          None         8   NaN
15  2022-05-22 12:57:56.890232          1          None         2   NaN
16  2022-05-22 12:58:02.899781          0          None         1   NaN
17  2022-05-22 12:58:07.996315          1          None         1   NaN